In [188]:
import pandas as pd
import numpy as np

In [189]:
students = pd.read_csv("student_records_dirty.csv")

In [190]:
students.head(10)

,student_id,first_name,last_name,age,major,enrollment_date,course_grade,gpa,tuition_paid
0,17270,Taylor,Chen,23,Bio,2024-02-28,12,3.8,17548.10
1,10860,Olivia,Martinez,73,Computer Science,"January 30, 2024",12,2.7,13129.13
2,15390,Priya,Garcia,52,bio,2024-02-10,95,1.9,19051.36
3,15191,Priya,Anderson,61,CS,2024-02-08,3,2.0,17242.61
4,15734,Noah,Wilson,36,Comp Sci,"February 08, 2024",-20,3.2,NaN
5,16265,Sam,Chen,81,psych,"April 23, 2024",88,3.5,20527.69
6,10466,Evan,Anderson,24,Psych,2024-05-26,-20,NaN,20000.00
7,14426,Emma,Lopez,32,CS,2024-05-06,NaN,3.5,20537.30
8,15578,Noah,Brown,30,Psych,2024-02-15,12,1.9,18016.20
9,18322,Liam,Patel,31,Biology,2024-02-14,52,3.8,21382.10

In [191]:
students.sample(10)

,student_id,first_name,last_name,age,major,enrollment_date,course_grade,gpa,tuition_paid
279,19146,Luis,Wilson,79,Biology,2024-03-15,88,2.0,16276.31
40,15393,Maria,Smith,46,Comp Sci,2024-02-10,95,1.9,14655.73
202,10197,Emma,Garcia,61,Bio,"January 30, 2024",-20,1.9,21724.37
330,17455,Zoe,Garcia,68,Bio,2024-02-22,76,3.5,18169.98
237,19208,Liam,Garcia,70,psych,"May 03, 2024",3,3.8,21038.30
77,19268,Jamie,Wilson,39,Biology,2024-03-13,100,3.2,18167.45
44,12612,Luis,Wilson,35,BIO,"February 18, 2024",-20,NaN,16007.14
173,11291,Zoe,Davis,23,BIO,"May 10, 2024",ninety,NaN,NaN
255,14199,Alex,Patel,43,Biology,2024-03-07,95,3.8,21642.70
112,13840,Emma,Smith,18,PSYCH,2024-01-31,100,NaN,16814.55

In [192]:
students['course_grade'].value_counts(dropna=False)

course_grade
100         36
12          34
NaN         32
 ninety     32
95          27
-20         27
0           27
52          25
64          25
 85         25
88          24
3           22
76          19
Name: count, dtype: int64

In [193]:
students['major'].value_counts(dropna=False)

major
Bio                 38
Comp Sci            38
Biology             38
PSYCH               33
CS                  31
psych               30
Psychology          30
Computer Science    29
BIO                 27
Psych               24
computer science    21
bio                 16
Name: count, dtype: int64

In [194]:
students['first_name'].value_counts()

first_name
Liam       22
Jordan     21
Maria      20
Mia        20
Chloe      19
Luis       18
Sam        18
Noah       18
Olivia     17
Ravi       17
Jamie      17
Evan       16
Taylor     15
Zoe        15
Priya      14
Ben        14
Emma       12
Aisha      12
Alex       12
Ethan      10
EMMA        2
 Olivia     2
ZOE         2
Emma        2
luis        2
Sam         2
 Mia        2
 Priya      1
AISHA       1
Jamie       1
Ravi        1
 Chloe      1
Taylor      1
Ben         1
 Jordan     1
 Emma       1
Ethan       1
RAVI        1
 Taylor     1
jamie       1
Luis        1
Name: count, dtype: int64

In [195]:
students['last_name'].value_counts()

last_name
Patel        29
Anderson     27
Smith        27
Wilson       27
Davis        25
Martinez     25
Garcia       25
Nguyen       23
Clark        22
Kim          21
Lopez        21
Brown        20
Johnson      19
Chen         16
 Lopez        3
Brown         2
Johnson       2
LOPEZ         2
Clark         2
JOHNSON       2
WILSON        1
ANDERSON      1
Davis         1
 Martinez     1
CHEN          1
davis         1
 Brown        1
Kim           1
nguyen        1
clark         1
PATEL         1
Anderson      1
lopez         1
Martinez      1
wilson        1
Name: count, dtype: int64

In [196]:
students.isna().sum()

student_id          0
first_name          0
last_name           0
age                 0
major               0
enrollment_date     0
course_grade       32
gpa                94
tuition_paid       21
dtype: int64

In [197]:
students['course_grade'] = students["course_grade"].replace("\"N/A\"", np.nan)

In [198]:
students = students.drop_duplicates()
students

,student_id,first_name,last_name,age,major,enrollment_date,course_grade,gpa,tuition_paid
0,17270,Taylor,Chen,23,Bio,2024-02-28,12,3.8,17548.10
1,10860,Olivia,Martinez,73,Computer Science,"January 30, 2024",12,2.7,13129.13
2,15390,Priya,Garcia,52,bio,2024-02-10,95,1.9,19051.36
3,15191,Priya,Anderson,61,CS,2024-02-08,3,2.0,17242.61
4,15734,Noah,Wilson,36,Comp Sci,"February 08, 2024",-20,3.2,NaN
...,...,...,...,...,...,...,...,...,...
345,10537,Taylor,Martinez,82,Biology,2024-02-18,-20,3.8,20783.40
346,15986,Sam,Davis,59,Computer Science,2024-03-19,64,2.0,18087.82
347,11841,Evan,Martinez,39,PSYCH,"March 28, 2024",95,2.7,20000.00
348,18716,Aisha,Brown,71,Psychology,"January 01, 2024",ninety,NaN,13621.58
349,16971,Ben,Martinez,32,Comp Sci,"April 30, 2024",3,3.8,14181.07

In [199]:
students["first_name"] = students["first_name"].str.strip().str.upper()
students

,student_id,first_name,last_name,age,major,enrollment_date,course_grade,gpa,tuition_paid
0,17270,TAYLOR,Chen,23,Bio,2024-02-28,12,3.8,17548.10
1,10860,OLIVIA,Martinez,73,Computer Science,"January 30, 2024",12,2.7,13129.13
2,15390,PRIYA,Garcia,52,bio,2024-02-10,95,1.9,19051.36
3,15191,PRIYA,Anderson,61,CS,2024-02-08,3,2.0,17242.61
4,15734,NOAH,Wilson,36,Comp Sci,"February 08, 2024",-20,3.2,NaN
...,...,...,...,...,...,...,...,...,...
345,10537,TAYLOR,Martinez,82,Biology,2024-02-18,-20,3.8,20783.40
346,15986,SAM,Davis,59,Computer Science,2024-03-19,64,2.0,18087.82
347,11841,EVAN,Martinez,39,PSYCH,"March 28, 2024",95,2.7,20000.00
348,18716,AISHA,Brown,71,Psychology,"January 01, 2024",ninety,NaN,13621.58
349,16971,BEN,Martinez,32,Comp Sci,"April 30, 2024",3,3.8,14181.07

In [200]:
students["last_name"] = students["last_name"].str.strip().str.upper()
students

,student_id,first_name,last_name,age,major,enrollment_date,course_grade,gpa,tuition_paid
0,17270,TAYLOR,CHEN,23,Bio,2024-02-28,12,3.8,17548.10
1,10860,OLIVIA,MARTINEZ,73,Computer Science,"January 30, 2024",12,2.7,13129.13
2,15390,PRIYA,GARCIA,52,bio,2024-02-10,95,1.9,19051.36
3,15191,PRIYA,ANDERSON,61,CS,2024-02-08,3,2.0,17242.61
4,15734,NOAH,WILSON,36,Comp Sci,"February 08, 2024",-20,3.2,NaN
...,...,...,...,...,...,...,...,...,...
345,10537,TAYLOR,MARTINEZ,82,Biology,2024-02-18,-20,3.8,20783.40
346,15986,SAM,DAVIS,59,Computer Science,2024-03-19,64,2.0,18087.82
347,11841,EVAN,MARTINEZ,39,PSYCH,"March 28, 2024",95,2.7,20000.00
348,18716,AISHA,BROWN,71,Psychology,"January 01, 2024",ninety,NaN,13621.58
349,16971,BEN,MARTINEZ,32,Comp Sci,"April 30, 2024",3,3.8,14181.07

In [201]:
students["major"] = students["major"].str.strip().str.title()
students["major"] = students["major"].replace({
"Comp Sci" : "Computer Science",
"Cs" : "Computer Science",
"Bio" : "Biology",
"Psych" : "Psychology"
})

In [202]:
students["major"].value_counts()

major
Computer Science    118
Biology             117
Psychology          115
Name: count, dtype: int64

In [203]:
students["course_grade"].value_counts()

course_grade
100         36
12          34
 ninety     31
0           27
95          26
-20         26
64          25
52          25
 85         24
88          24
3           21
76          19
Name: count, dtype: int64

In [204]:
students["course_grade"] = students["course_grade"].str.strip()
students.loc[students["course_grade"] == "ninety", "course_grade"] = 90

In [205]:
students["course_grade"].value_counts()

course_grade
100    36
12     34
90     31
0      27
95     26
-20    26
64     25
52     25
85     24
88     24
3      21
76     19
Name: count, dtype: int64

In [206]:
students["age"] = pd.to_numeric(students['age'], errors = "coerce")

In [207]:
students['age'].describe()

count    350.000000
mean      53.768571
std       26.939509
min      -12.000000
25%       33.000000
50%       52.000000
75%       72.000000
max      230.000000
Name: age, dtype: float64

In [208]:
students.loc[students["age"] < 5, "age"] = np.nan
students.loc[students["age"] > 120, "age"] = np.nan

In [209]:
students["age"].describe()

count    345.000000
mean      52.617391
std       20.951321
min       17.000000
25%       33.000000
50%       52.000000
75%       71.000000
max       89.000000
Name: age, dtype: float64

In [210]:
students["age"].dropna().sort_values(ascending=False)

258    89.0
125    89.0
296    89.0
305    88.0
206    88.0
       ...
56     17.0
297    17.0
284    17.0
53     17.0
51     17.0
Name: age, Length: 345, dtype: float64

In [211]:
#create a column combining first and last names
students["full_name"] = students["last_name"] + ', ' + students["first_name"]
students["full_name"].sort_values()

322    ANDERSON, AISHA
337      ANDERSON, BEN
307      ANDERSON, BEN
317    ANDERSON, CHLOE
214     ANDERSON, EMMA
            ...
64         WILSON, SAM
87         WILSON, SAM
332     WILSON, TAYLOR
185        WILSON, ZOE
263        WILSON, ZOE
Name: full_name, Length: 350, dtype: object

In [212]:
students["age_group"] = pd.cut(
    students["age"],
    bins=[0, 25, 65, 120], 
    labels=["Young Adults", "Working Adults", "Retired"]
)

In [213]:
students[["age", "age_group"]].value_counts()

age   age_group
74.0  Retired           12
32.0  Working Adults    11
85.0  Retired            9
33.0  Working Adults     9
49.0  Working Adults     8
                        ..
64.0  Working Adults     2
87.0  Retired            2
86.0  Retired            2
57.0  Working Adults     1
27.0  Working Adults     1
Name: count, Length: 73, dtype: int64

In [214]:
students["costPerSemester"] = students['tuition_paid'] / 3
students["costPerSemester"].sort_values(ascending=False).dropna()

126    8717.076667
269    8291.756667
67     8103.166667
47     8044.920000
338    8041.216667
          ...
175    3992.103333
137    3974.840000
131    3748.470000
90     3650.056667
249    3571.940000
Name: costPerSemester, Length: 330, dtype: float64

In [215]:
students["costPerSemester"].describe()

count     330.000000
mean     6115.561606
std       880.208480
min      3571.940000
25%      5583.553333
50%      6159.406667
75%      6666.666667
max      8717.076667
Name: costPerSemester, dtype: float64

In [219]:
students["enrollment_date"] = pd.to_datetime(students["enrollment_date"])

ValueError: time data "January 30, 2024" doesn't match format "%Y-%m-%d", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.